Config/Documents/ПереносОстатковВОперативныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПереносОстатковВОперативныйУчет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СтоимостьОбъектовОС</xr:Item>
				<xr:Item>InformationRegister.ПараметрыАмортизацииОСБухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.УчетныеДанныеОбъектаОС</xr:Item>
				<xr:Item>InformationRegister.СобытияОС</xr:Item>
				<xr:Item>AccumulationRegister.АмортизацияОбъектовОС</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииПереносОстатковОперУчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборКФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦМО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбесценения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ПараметрыАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыАмортизацииОСБухгалтерскийУчет</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядокПогашенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокПогашенияСтоимостиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособНачисленияАмортизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ОперацииПереносОстатковОперУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОперацииПереносОстатковОперУчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереносИноеДвиживое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносОЦИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносЗабаланс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ПорядокПогашенияСтоимостиОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПорядокПогашенияСтоимостиОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтоимостьНеПогашается</Name>
					<Comment>Для НФА на счетах 101.07, 101.08, 103</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПриВводеВЭксплуатацию</Name>
					<Comment>Применяется к объектам стоимостью не более 3000 (1000) рублей за единицу или иного лимита, установленного в учетной политике исходя из технологических особенностей</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеАмортизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ПереносОстатковВОперативныйУчет/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	УчетПоПодразделениям = УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям();
	
	Элементы.ОтборИФО.Видимость							= УчетПоИФО;
	Элементы.ОсновныеСредстваИФО.Видимость				= УчетПоИФО;
	Элементы.ОтборПодразделение.Видимость				= УчетПоПодразделениям;
	Элементы.ОсновныеСредстваПодразделение.Видимость	= УчетПоПодразделениям;
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Содержание = НСтр("ru = 'Перевод объектов по письму Минздрава №22-0/1045'");
	КонецЕсли;
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ОсновныеСредстваРедактироватьТЧ.Доступность = Не ТолькоПросмотр;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Если Объект.Проведен И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ОперацииПереносОстатковОперУчет.ПереносИноеДвиживое") Тогда
		ЕстьОборотыЗаТекущийГод = ЕстьОборотыОС(Объект.Ссылка);
		Если ЕстьОборотыЗаТекущийГод Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'По списываемым ОС есть обороты за текущий год. Эти обороты необходимо исправить.
			|Для просмотра документов с оборотами сформируйте печатную форму ""Обороты ОС за текущий год"".'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.ОсновныеСредства.Очистить();
	
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьОС(Команда)
	
	Если Объект.Проведен Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполнение доступно в не проведенном документе'"));
	Иначе
		ЗаполнитьОССервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьТЧ(Команда)
	
	Если Элементы.ОсновныеСредстваРедактироватьТЧ.Пометка Тогда
		ИзменитьРежимРедактированияТЧ();
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросРедактироватьТЧЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Рекомендуется заполнять таблицу по кнопке ""Заполнить"".
                            |Редактирование вручную следует использовать только в крайних случаях. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОССервер()
	
	Если Объект.ВидОперации = Перечисления.ОперацииПереносОстатковОперУчет.ПереносИноеДвиживое
		Или Объект.ВидОперации = Перечисления.ОперацииПереносОстатковОперУчет.ПереносОЦИ Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
		|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,
		|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
		|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,
		|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет
		|ПОМЕСТИТЬ ВТ_РБ
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
		|			&Период,
		|			Счет В (&СписокСчетов),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
		|			Организация = &Организация
		|				И ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).ТипНФА <> ЗНАЧЕНИЕ(Перечисление.ТипыНФА.БиблиотечныйФонд)
		|				И ИФО = &ИФО
		|				И КФО = &КФО) КАК ЖурналПроводокЕПСБУОстатки
		|ГДЕ
		|	ЖурналПроводокЕПСБУОстатки.КоличествоОстаток <> 0
		|	И ЖурналПроводокЕПСБУОстатки.СуммаОстаток / ЖурналПроводокЕПСБУОстатки.КоличествоОстаток <= 10000
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ ВТ_Параметры
		|ИЗ
		|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
		|			&Период,
		|			&Организация = Организация
		|				И ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ВТ_РБ.ОсновноеСредство КАК ОсновноеСредство
		|					ИЗ
		|						ВТ_РБ КАК ВТ_РБ)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
		|ГДЕ
		|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ПорядокПогашенияСтоимости <> ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
		|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	СтоимостьОбъектовОСОстатки.ЦМО КАК ЦМО,
		|	СтоимостьОбъектовОСОстатки.Подразделение КАК Подразделение,
		|	СтоимостьОбъектовОСОстатки.КоличествоОстаток КАК Количество,
		|	СтоимостьОбъектовОСОстатки.СтоимостьОстаток КАК Сумма,
		|	АмортизацияОбъектовОСОстатки.СуммаАмортизацииОстаток КАК СуммаАмортизации,
		|	АмортизацияОбъектовОСОстатки.СуммаОбесцененияОстаток КАК СуммаОбесценения,
		|	ВТ_РБ.ИФО КАК ИФО,
		|	ВТ_РБ.КФО КАК КФО,
		|	ВТ_РБ.КПС КАК КПС,
		|	ВТ_РБ.Счет КАК СчетУчета
		|ИЗ
		|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ВТ_Параметры.ОсновноеСредство КАК ОсновноеСредство
		|					ИЗ
		|						ВТ_Параметры КАК ВТ_Параметры)
		|				И ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
		|				И Подразделение = &Подразделение) КАК СтоимостьОбъектовОСОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АмортизацияОбъектовОС.Остатки(
		|				&Период,
		|				Организация = &Организация
		|					И ОсновноеСредство В
		|						(ВЫБРАТЬ
		|							ВТ_Параметры.ОсновноеСредство КАК ОсновноеСредство
		|						ИЗ
		|							ВТ_Параметры КАК ВТ_Параметры)) КАК АмортизацияОбъектовОСОстатки
		|		ПО СтоимостьОбъектовОСОстатки.ОсновноеСредство = АмортизацияОбъектовОСОстатки.ОсновноеСредство
		|			И СтоимостьОбъектовОСОстатки.ИнвентарныйНомер = АмортизацияОбъектовОСОстатки.ИнвентарныйНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РБ КАК ВТ_РБ
		|		ПО СтоимостьОбъектовОСОстатки.ОсновноеСредство = ВТ_РБ.ОсновноеСредство
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтоимостьОбъектовОСОстатки.ОсновноеСредство.Наименование,
		|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер.Код";
		
		Если Объект.ВидОперации = Перечисления.ОперацииПереносОстатковОперУчет.ПереносИноеДвиживое Тогда
			КодыСчетов = "101.30";
			ДатаОстатков = Объект.Дата;
		Иначе
			КодыСчетов = "101.20";
			ДатаОстатков = Объект.Дата;
		КонецЕсли;
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ОперацииПереносОстатковОперУчет.ПереносЗабаланс Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
		|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,
		|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
		|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,
		|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет
		|ПОМЕСТИТЬ ВТ_РБ
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
		|			&Период,
		|			Счет В (&СписокСчетов),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
		|			Организация = &Организация
		|				И ИФО = &ИФО
		|				И КФО = &КФО) КАК ЖурналПроводокЕПСБУОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
		|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	СтоимостьОбъектовОСОстатки.ЦМО КАК ЦМО,
		|	СтоимостьОбъектовОСОстатки.Подразделение КАК Подразделение,
		|	СтоимостьОбъектовОСОстатки.КоличествоОстаток КАК Количество,
		|	СтоимостьОбъектовОСОстатки.СтоимостьОстаток КАК Сумма,
		|	ВТ_РБ.ИФО КАК ИФО,
		|	ВТ_РБ.КФО КАК КФО,
		|	ВТ_РБ.КПС КАК КПС,
		|	ВТ_РБ.Счет КАК СчетУчета
		|ИЗ
		|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ВТ_РБ.ОсновноеСредство КАК ОсновноеСредство
		|					ИЗ
		|						ВТ_РБ КАК ВТ_РБ)
		|				И ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
		|				И Подразделение = &Подразделение) КАК СтоимостьОбъектовОСОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РБ КАК ВТ_РБ
		|		ПО СтоимостьОбъектовОСОстатки.ОсновноеСредство = ВТ_РБ.ОсновноеСредство
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтоимостьОбъектовОСОстатки.ОсновноеСредство.Наименование,
		|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер.Код";
		
		ДатаОстатков = Объект.Дата;
		КодыСчетов = "21.20";
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период"			, Новый Граница(ДатаОстатков, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("СписокСчетов"	, БухгалтерскийУчет.СписокСчетов(КодыСчетов));
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(Объект.ОтборИФО) Тогда
		Запрос.УстановитьПараметр("ИФО", Объект.ОтборИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИФО = &ИФО", "");
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЖурналПроводокЕПСБУОстатки.ИФО", "Значение(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ОтборКФО) Тогда
		Запрос.УстановитьПараметр("КФО", Объект.ОтборКФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КФО = &КФО", "");
	КонецЕсли;
	
	Если УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям() И ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Объект.ОтборПодразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Подразделение = &Подразделение", "");
	КонецЕсли;
	Если Не УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СтоимостьОбъектовОСОстатки.Подразделение", "Значение(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Объект.ОсновныеСредства.Загрузить(Результат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьОборотыОС(ДокументСсылка)
	
	СписокДок = Документы.ПереносОстатковВОперативныйУчет.ДокументыОборотов(ДокументСсылка);
	Результат = (СписокДок.Количество() > 0);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВопросРедактироватьТЧЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ИзменитьРежимРедактированияТЧ();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРежимРедактированияТЧ()
	
	НоваяПометка = Не Элементы.ОсновныеСредстваРедактироватьТЧ.Пометка;
	
	Элементы.ОсновныеСредстваРедактироватьТЧ.Пометка = НоваяПометка;
	Элементы.ОсновныеСредства.ТолькоПросмотр = Не НоваяПометка;
	
КонецПроцедуры

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)
	
	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперации()
	
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
